
# n = 5

# print(n)

# если вы точно знаете,что вам понадобится какая-то пременная,
# но еще не понимаете какой тип данных она будет иметь.
# вы можете создать переменную и присвоить ей пустое значение,можно написать none

# n = None

# print(n)

# также можно создавать дробные числа

# n = 1, 89

# print(n)

# python имеет динамическую типизацию данных.соответственно из этого следует вывод,что мы можем присваивать другое значение.например попробуем создать строку,создается с помощью кавычек.они могут быть как одинарными и также эти кавычки у нас могут быть двойными

# n = 1, 89

# print(n)
# n = 'fddf'
# print(n)
# n1 = "vfdffvd"

# видим что сначала выводиться число,а потом строка
