# a = 'qwerty'

# # print(a[2])
# будет выводиться буква e

# a = 'qwerty'
# for i in a:
#     print(i)

# слово целиком

# вложенные циклы

# line = ""
# for i in range(5):
#     line = ""
#     for j in range(5):
#         line += "*"
#     print(line)

# Программный код выведет 5 строк “******”. Сначала запускается внешний цикл с
# i(счетчик цикла). После этого запускается внутренний цикл с j(счетчик цикла).
# После того как внутренний цикл завершил свою работу, переменная line = “*****” и
# выводится на экран, далее опять повторяется внешний цикл и так 5 раз.
