# до этого мы говорили про типы данных,давайте посмотрим как типы данных моежт выявлять пайтон. как нам выводить в консоль.
# какая переменная имеет тот или иной тип данных.
# для начала создаздим еще раз переменную и присвоим ей целочисленное значение.
# далее напишем функцию print в которой будем вызвать функцию type и название нашей переменной n
# у нас выводиться int,т.е. данная переменная имеет класс int тип данных int

# n = 5
# print(type(n))

# соответственно если будем присваивать другое значение создадим строку,то у нас будет другой тип данных str

# n = 'fddf'
# print(type(n))

# как можно использовать кавычки.соответственно если напишем обычную кавычку одну n = 'fd'df' то у нас будет ошибка,
# чтобы пайтон смог понять мы должны написать слэш

# n = 'fd\'df'
# print(n)

# также можем использовать двойные кавычки внутри

# n = 'fd"gktgkmg"df'
# print(n)

# разберем такое понятие как комментирование строк """ перед и после

print(5)
print(5)
print(5)

# print(5, 8)
print(5)
print(5, 9)
