# основные арифметические операции

# + Сложение
# - Вычитание
# * Умножение
# / Деление (по умолчанию в
# вещественных числах)
# % Остаток от деления
# // Целочисленное деление
# ** Возведение в степень

# Округление чисел
# Создадим две переменные

# a = 5.89956
# b = 6.556551
# print(a*b)

# представим что хотим взять из этого числа только первые три знака после запятой.воспользуемся функцией round.
# функция round принимает на вход два аргумента.первый аргумент это какое-то число и второй аргумент число знаков после запятоц,которые мы хотми оставить 8 или 2

# a = 5.89956
# b = 6.556551
# print(round(a*b, 3))

# разберем сокращенные присваивания

#  в си шарпе i++
# в питоне тоже есть такая возможность

# iter = 2
# iter += 3  # iter = iter + 3
# iter -= 4  # iter = iter - 4
# iter *= 5  # iter = iter * 5
# iter /= 5  # iter = iter / 5
# iter //= 5  # iter = iter // 5
# iter %= 5  # iter = iter % 5
# iter **= 5  # iter = iter ** 5
